app/controllers/candidates_controller.rb

  def create
    @candidate = Candidate.new(candidate_params)
    if @candidate.save
---
INSERT INTO "candidates" ("name", "date", "installment_payment", "due_date", "unit_no", "payment_plan", "work_stage", "installment_no", "cheque", "account_no", "ifsc_code", "bank_details", "authorized_sign", "created_at", "updated_at", "due_amount", "interest_on_delayed_payment") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @candidates = Candidate.all
---
SELECT "candidates".* FROM "candidates"

  def edit
    @candidate = Candidate.find(params[:id])
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @candidate = Candidate.find(params[:id])

   if @candidate.update(candidate_params)
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "candidates" SET "authorized_sign" = ?, "due_amount" = ?, "updated_at" = ? WHERE "candidates"."id" = ?  [["authorized_sign", "Amritpal Singh"], ["due_amount", 2967000], ["updated_at", "2019-06-28 06:36:44.292819"], ["id", 8]]

  def destroy
    @candidate = Candidate.find(params[:id])
    @candidate.destroy
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 3]]

  def create_pdf
		@candidate = Candidate.find(params[:id])
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]